{
    "version": "https://jsonfeed.org/version/1",
    "title": "Milwaukee County Blog",
    "description": "",
    "home_page_url": "https://MkeCountyBlog.com",
    "feed_url": "https://MkeCountyBlog.com/feed.json",
    "user_comment": "",
    "icon": "https://MkeCountyBlog.com/media/website/MCBlogfaviconBig.png",
    "author": {
        "name": "Colin White"
    },
    "items": [
        {
            "id": "https://MkeCountyBlog.com/print-story.html",
            "url": "https://MkeCountyBlog.com/print-story.html",
            "title": "Print Story",
            "summary": " ",
            "content_html": "\n  <p>\n    \n  </p>",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "Concordia College",
                   "CUW"
            ],
            "date_published": "2020-12-02T15:12:15-06:00",
            "date_modified": "2020-12-02T15:15:57-06:00"
        },
        {
            "id": "https://MkeCountyBlog.com/audio-slideshow.html",
            "url": "https://MkeCountyBlog.com/audio-slideshow.html",
            "title": "Audio Slideshow",
            "summary": " ",
            "content_html": "\n  <p>\n    \n  </p>",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "Concordia College",
                   "CUW"
            ],
            "date_published": "2020-12-02T15:11:22-06:00",
            "date_modified": "2020-12-02T15:15:53-06:00"
        },
        {
            "id": "https://MkeCountyBlog.com/audio-story.html",
            "url": "https://MkeCountyBlog.com/audio-story.html",
            "title": "Audio Story",
            "summary": " ",
            "content_html": "\n  <p>\n    \n  </p>",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "Concordia College",
                   "CUW"
            ],
            "date_published": "2020-12-02T15:11:05-06:00",
            "date_modified": "2020-12-02T15:15:47-06:00"
        },
        {
            "id": "https://MkeCountyBlog.com/concordia-to-wgema-40-years-of-transistions.html",
            "url": "https://MkeCountyBlog.com/concordia-to-wgema-40-years-of-transistions.html",
            "title": "Concordia to Wgema: 40 Years of Transistions",
            "summary": " Audio Slideshow Audio Story Print Story ",
            "content_html": "\n    <h3 id=\"audio-slideshow\" class=\"align-center\">\n      <a href=\"https://MkeCountyBlog.com/audio-slideshow.html\">\n      Audio Slideshow\n      </a>\n    </h3>\n\n    <h3 id=\"audio-story\" class=\"align-center\">\n      <a href=\"https://MkeCountyBlog.com/audio-story.html\">\n      Audio Story\n      </a>\n    </h3>\n\n    <h3 id=\"print-story\" class=\"align-center\">\n      <a href=\"https://MkeCountyBlog.com/print-story.html\">\n      Print Story\n      </a>\n    </h3>\n\n  <p>\n    \n  </p>",
            "image": "https://MkeCountyBlog.com/media/posts/10/2006.jpeg",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "Concordia College",
                   "CUW"
            ],
            "date_published": "2020-12-01T19:52:52-06:00",
            "date_modified": "2020-12-02T15:17:38-06:00"
        },
        {
            "id": "https://MkeCountyBlog.com/securing-the-final-link-in-the-absentee-ballot-chain.html",
            "url": "https://MkeCountyBlog.com/securing-the-final-link-in-the-absentee-ballot-chain.html",
            "title": "Securing the Final Link in the Absentee Ballot Chain",
            "summary": " With election 2020 winding down (hopefully🤞) we once again have claims of election fraud flying around; this time in regards to absentee (mail-in) ballots. Putting the actual prevalence of absentee voting fraud aside; let's look at where some realistic vulnerabilities in the current process&hellip;",
            "content_html": "\n  <p>\n    With election 2020 winding down (hopefully🤞) we once again have claims of election fraud flying around; this time in regards to absentee (mail-in) ballots. Putting the actual prevalence of absentee voting fraud aside; let's look at where some realistic vulnerabilities in the current process are and one idea on how to deal with them. Absentee voting is handled pretty well in Wisconsin with a few areas left to improve upon. Below is a summary of my understanding of the current voting process.\n  </p>\n\n  <ol>\n    <li><a href=\"https://myvote.wi.gov/en-US/RegisterToVote\" target=\"_blank\">Register to vote</a>: requires <a href=\"https://elections.wi.gov/publications/voter-guides/proof-of-residence\" target=\"_blank\">proof of residence</a> (Driver’s License or state ID works here)</li><li>Signup for an absentee ballot (aka mail-in ballot.)</li><li>Receive ballot in the mail.</li><li>Find a witness.</li><li>Fill out your ballot.</li><li>Place completed ballot in the included envelope and seal it.</li><li>Fill out your address and sign the exterior of the envelope.</li><li>Have a witness fill out their address and then sign the envelope.</li><li>Put your ballot in a mailbox for USPS pickup 📬.</li><li>USPS picks up the ballot and takes it to a sorting facility 📪.</li><li>The ballot is delivered to your local polling place.</li><li>On election day information from #7 and #8 is verified; the envelope is opened; your ballot is sent through the voting machine; vote is cast; process done.<br></li>\n  </ol>\n\n  <p>\n    The link in the chain that remains particularly contentious and open to <a href=\"https://www.msn.com/en-us/news/politics/philadelphia-election-judge-admits-to-stuffing-ballot-boxes-for-democrats-in-three-separate-elections/ar-BB14qWhl\" target=\"_blank\">legitimate fraud</a>&nbsp;is step #12. If a voter fills out an absentee ballot they are likely not at the polling place when their ballot is removed and put through the voting machine. Our current system relies on voters to trust their local polling place volunteers to honestly cast their absentee votes; many believe this is an opening for cheating. Below is one idea how to address this concern and help voters verify that their ballots weren’t manipulated before being run through the voting machine.\n  </p>\n\n  <ol>\n    <li>Fill out your ballot</li><li>Go to the state voting website and open the (new!) ballot validation page.</li><li>Fill out required information including your name and address as well as voting selections.</li><li>The website will use this information to create a unique confirmation code without the information ever leaving your computer.</li><li>Write down the code and then mail your ballot.</li><li>After the ballot is cast, the voting website will present a confirmation code generated as the vote is processed at the polling location using the same information on the actual ballot that was used during step #4.</li><li>If the codes from #4 and #6 match, no tampering took place; if they don’t something went wrong and you contact the state election’s board.</li>\n  </ol>\n\n  <p>\n    The above process should be optional but would allow anyone to verify for themselves that their ballot contained their unaltered selections. Trust shifts from the volunteers to the voting machines that process ballots. Any change to the ballot would generate a different confirmation code thus informing the voter that something went wrong with their ballot. In that event they can contact the local authorities or the election board.\n  </p>\n\n  <p>\n    The rest of the voting process can use some improvements as well. I consider the witness requirement in Wisconsin to be an unnecessary burden and an example of <a href=\"https://en.wikipedia.org/wiki/Security_theater\" target=\"_blank\">security theater</a>. According to the <i><a href=\"https://www.chicagotribune.com/election-2020/ct-nw-2020-ballot-witness-notary-public-requirement-20200925-sg4n6sf6prd5hetrzl6iqml25a-story.html\" target=\"_blank\">Associated Press</a></i>,\n  </p>\n\n    <figure class=\"blockquote\">\n      <blockquote>Proponents of the requirement say it’s designed to prevent voter fraud by holding others accountable for vouching for a voter.</blockquote>\n      <figcaption>AP: Gary D. Robertson & Scott Bauer</figcaption>\n    </figure>\n\n  <p>\n    It is difficult to fathom the type of crime this is preventing. This appears more likely to cause a valid ballot to be tossed than to prevent any real election malfeasance. If a person is willing to falsify ballots or manipulate votes in some way why would they then have any issue with falsifying the witness portion of the ballot? If you have an idea please let me know in the comments.\n  </p>\n\n  <p>\n    Finally, verifying that a person is a resident of the state before they vote is an important part of any election and I believe the voter ID requirement is a logical way to do so. Those without a driver’s license are able to get a free photo ID card from the DMV. Planning ahead and taking some time to go get an ID seems like a reasonable requirement that allows more people to trust the voting process.\n  </p>\n\n  <p>\n    Many will argue that voter fraud is rare; however many others seem to believe it is prevalent and tipping the scales in their opponent's favor. This fairly simple, free ID requirement seems to address some of the second group's concerns. My proposed idea may enable the remainder of the absentee voting process to become more trustworthy as well. The goal for Wisconsin as well as the rest of the United States should be to maintain the credibility of our elections and continually evaluate options for doing so.\n  </p>\n\n  <p>\n    <b>Update 11/15/20</b><br>After more consideration as well as observing some of the shenanigans happening around the country, the confirmation code idea is open to misuse. Nothing prevents a person from generating multiple confirmations and then claiming ballot manipulation after the fact. Oh well, back to the drawing board.<br>\n  </p>\n\n  <p>\n    Featured image by <a href=\"https://unsplash.com/@joshua_j_woroniecki?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Joshua Woroniecki</a> on <a href=\"https://unsplash.com/s/photos/election?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a>.\n  </p>",
            "image": "https://MkeCountyBlog.com/media/posts/9/joshua-woroniecki-nSbsfmvURt8-unsplash.jpg",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "Wisconsin",
                   "Security",
                   "Election",
                   "Absentee Ballot"
            ],
            "date_published": "2020-11-09T08:37:17-06:00",
            "date_modified": "2020-11-15T08:03:25-06:00"
        },
        {
            "id": "https://MkeCountyBlog.com/protonmail-bridge-and-thunderbird-smtp-issue-resolution.html",
            "url": "https://MkeCountyBlog.com/protonmail-bridge-and-thunderbird-smtp-issue-resolution.html",
            "title": "Resolution For ProtonMail Bridge &amp; Thunderbird SMTP Issue",
            "summary": "While setting up the ProtonMail Bridge with Thunderbird 78.3.2 today I discovered that Thunderbird's standard self-signed certificate dialog no longer appears before sending the first message; making sending emails impossible. While ducking around (duckduckgo.com) I discovered this is a known bug that will be fixed&hellip;",
            "content_html": "<p>While setting up the ProtonMail Bridge with Thunderbird 78.3.2 today I discovered that Thunderbird's standard self-signed certificate dialog no longer appears before sending the first message; making sending emails impossible. While ducking around (<a href=\"https://duckduckgo.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">duckduckgo.com</a>) I discovered this is a known bug that will be fixed in an upcoming release of Thunderbird; but I want to use it now!!! 🙎🤣</p>\n<p>My work around is tedious but simple.</p>\n<ol>\n<li>Open ProtonMail Bridge.</li>\n<li>Click the 'Settings' button.</li>\n<li>'Advanced Settings.'</li>\n<li>'Change IMAP &amp; SMTP settings.'</li>\n<li>Change the IMAP &amp; SMTP ports to a random number like 1145 and 1026 respectively and then click 'Okay.'</li>\n<li>Bridge will automatically close and reopen. Follow steps 2-5 but this time only change the IMAP port to 1025.</li>\n<li>Open Thunderbird and setup a new account using account information from Bridge.</li>\n<li>Permanently store the certificate when the scary message pops open.</li>\n<li>In Thunderbird delete the account from step 7-8.</li>\n<li>In Bridge repeat steps 2-5. This time set the default ports again. (IMAP: 1143  SMTP: 1025)</li>\n<li>Repeat Steps 7-8 and enjoy!</li>\n</ol>\n<p>I have been hopping back and forth between <a href=\"https://mailbox.org\" target=\"_blank\" rel=\"noopener noreferrer\">mailbox.org</a> and <a href=\"https://protonmail.com\" target=\"_blank\" rel=\"noopener noreferrer\">ProtonMail</a> for a couple of years. ProtonMail has come along far enough now that I believe I'll stick with them for the long term. My primary reasoning behind paying a premium for their service is my email is all stored encrypted on their servers; in the unlikely event anyone broke into their infrastructure, all the villains would find readable are the recipients and the subject of my emails (neither of which concerns me.) As I occasionally receive tax and other financial information through email, this grants me some peace of mind. With Proton, incoming email is the main vulnerability as this is the only point in the chain where it remains unencrypted in relation to their servers.</p>\n<p>I have read others criticize ProtonMail for not supporting IMAP and SMTP standards used by ordinary email providers (gmail, Outlook, Zoho) but I believe this argument is flawed. Other email providers expect users to do all of the work of encrypting emails themselves which a tiny fraction of a percent of users actually do. ProtonMail was developed with the goal of privacy, security and ease of use out of the box which makes using the existing standards too restraining.</p>\n<p>Removing the complexity and annoyance of PGP is a relief (I was using it client side for several years prior to the switch to ProtonMail.) Attempting to manually encrypt all of my existing unencrypted emails was a nightmare that Proton greatly simplified.</p>\n<p>One final point is that ProtonMail allows IMAP and SMTP access on the desktop through their bridge application. While it is certainly slower than an unencrypted alternative, I find the lag to be within an acceptable amount. I am also happy they <a href=\"https://github.com/ProtonMail\" target=\"_blank\" rel=\"noopener noreferrer\">have open sourced</a> the majority of their client code as of October 2020.</p>\n<p>There is still more work to do on their end to polish and improve but as of now, they are much closer to having a PGP email product I can recommend to my folks without having to worry about constant problems. I cannot say the same for IMAP SMTP clients using PGP.</p>",
            "image": "https://MkeCountyBlog.com/media/posts/8/fongit-2.jpg",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "Thunderbird",
                   "ProtonMail",
                   "Privacy",
                   "Open Source",
                   "Email"
            ],
            "date_published": "2020-10-12T00:21:56-05:00",
            "date_modified": "2020-10-12T10:54:44-05:00"
        },
        {
            "id": "https://MkeCountyBlog.com/wisconsin-governors-vetoes-tip-the-scales.html",
            "url": "https://MkeCountyBlog.com/wisconsin-governors-vetoes-tip-the-scales.html",
            "title": "Wisconsin Governor&#x27;s Vetoes Tip The Scales",
            "summary": " This post sprang to mind while thinking about the Wisconsin governor's veto powers after a recent Wisconsin Supreme Court ruling that attempted to clarify restrictions to this broad power amended to our state constitution in 1930. Much of the commentary focused on the specific&hellip;",
            "content_html": "\n  <p>\n    This post sprang to mind while thinking about the Wisconsin governor's veto powers after a <a href=\"https://www.wpr.org/wisconsin-supreme-court-strikes-down-3-evers-vetoes\" target=\"_blank\">recent Wisconsin Supreme Court ruling</a> that attempted to clarify restrictions to this broad power amended to our state constitution in 1930. Much of the commentary focused on the specific vetoes from today's case but my thoughts shifted towards why Wisconsin has such a strong veto and why so much power was placed in a single branch of our state government. This year I have been reading&nbsp;<a href=\"https://www.amazon.com/Conservative-Sensibility-George-F-Will-ebook/dp/B07J525HRP/\" target=\"_blank\" rel=\"nofollow noopener\">The Conservative Sensibility</a> by George F. Will. The first few chapters discuss the original design of the United States' federal government with a thorough description of the intended limits and separations.\n  </p>\n\n  <p>\n    The progressive movement gained steam in the early 20th century and progressively (see what I did there&nbsp;😉) tilted the balance of power towards the executive branch and away from the legislative and judicial branches. The design of the Wisconsin veto appeared to follow a similar pattern as described in the book. The veto turned out to be the result of a legitimate concern of how the bundling of many individual issues into a single, massive appropriation bill could force the governor to accept budget items that he disagrees with in order to allow the rest of the bill to pass. This was wonderful foresight as the United States has this very issue in Congress today. It appears hardly anyone in Congress knows the content of the bills they sign or reject as they have become so long and complicated as to make the task of reading them in their entirety nearly impossible prior to voting.\n  </p>\n\n    <figure class=\"blockquote\">\n      <blockquote>Early critics of the omnibus appropriations process worried that it bundled too many disparate concerns into one bill that a governor would be forced to either sign into law or veto in full. This approach unfairly strengthened the Legislature's power over a governor's, their argument held, by effectively forcing a governor to accept individual budget items that they may not support in order to pass the larger budget bill. This fear heightened in the late 1920s, when a new law required the governor to propose a single budget, effectively ending any possibility that a state budget could be passed piece by piece.<br><br>In an effort to rebalance powers over the state budget, state Senator William Titus, a Progressive from Fond du Lac, proposed a constitutional amendment in 1927 that would give governors the ability to veto pieces of an appropriations bill.</blockquote>\n      <figcaption>Will Cushman, WisContext</figcaption>\n    </figure>\n\n  <p>\n    Unfortunately governors of course eventually abused this veto power. Instead of vetoing specific budget items, governors began removing numbers, letters, and words to change the legislature's intended meaning; a gross misuse of power outside of the governor's purview. A made up example below illustrates how the governor could change a bill that sends a large amount of money to Milwaukee school libraries into a tiny amount of money for public schools.\n  </p>\n\n    <blockquote class=\"blockquote\">\n      <b>Originally:</b>&nbsp;\"$10,000 to Milwaukee Public School Libraries\"<br><b>Veto Applied:</b> \"$10<s>,000</s> to <s>Milwaukee </s>Public School<s> Librarie</s>s\"<br><b>Result:</b> \"$10 to Public Schools\"<br>\n    </blockquote>\n\n  <p>\n    Government at most levels appears to have expanded well outside of their intended purposes. The legislature is intended to create and introduce legislation; the governor is intended to approve or veto the legislation they propose. The shift away from these roles has helped provide a significantly less reliable government for us today. For further reading, a very fine history of the Wisconsin veto is available from <a href=\"https://wiscontext.org/story-wisconsins-singular-partial-veto\" target=\"_blank\">WisContext</a>.\n  </p>\n\n  <p>\n    \n  </p>",
            "image": "https://MkeCountyBlog.com/media/posts/7/Wisconsin_Supreme_Court-3.jpg",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "governor",
                   "Wisconsin Supreme Court",
                   "Wisconsin"
            ],
            "date_published": "2020-07-17T13:31:03-05:00",
            "date_modified": "2020-10-11T15:28:14-05:00"
        },
        {
            "id": "https://MkeCountyBlog.com/simplifying-listsnotesto-do-organization-with-caldav.html",
            "url": "https://MkeCountyBlog.com/simplifying-listsnotesto-do-organization-with-caldav.html",
            "title": "Simplifying Lists/Notes/To-do Organization With CalDAV",
            "summary": " Finding an intuitive way to organize notes and to-dos into a simple, cross-platform tool has been a tiring multiyear search. I started with Pocket for storing articles and Joplin for notes but ended up using Nextcloud's builtin CalDAV as well as the many good&hellip;",
            "content_html": "\n  <p>\n    Finding an intuitive way to organize notes and to-dos into a simple, cross-platform tool has been a tiring multiyear search. I started with Pocket for storing articles and Joplin for notes but ended up using Nextcloud's builtin CalDAV as well as the many good clients this provides. Saved articles are primarily used for improving&nbsp;<a href=\"https://www.openstreetmap.org/#map=15/43.0427/-87.9159\" target=\"_blank\" class=\"\">OpenStreetMap</a>&nbsp;in the Milwaukee region. Notes are mostly quick reference points for Linux commands that I don't want to forget (or remember) as well as lists of books/movies/music to consume later or a place to jot down some notes during a meeting.\n  </p>\n\n  <p>\n    <a href=\"https://joplinapp.org/\" target=\"_blank\">Joplin</a> worked fairly well but only works comfortably within their electron app; limiting client options. Its main selling point compared to other similar products is that it stores all files, optionally encrypted, locally on your device. Syncing is optionally done with services like Nextcloud, Google Drive or Dropbox. During my time with it, they introduced the Web-Clipper enabling users to copy an entire article's content into a note thus making Pocket redundant. Every link stored with Pocket thus was individually opened in order to clip into Joplin before deleting the Pocket account. However, Joplin never worked as quickly or flexibly as I hoped for. To make or check a note requires starting up the Joplin app, waiting for it to load, and entering the password (if encrypted). At the time (2018?), sync issues were common. For what it does Joplin is a great tool but was unable to provide what I needed (web-clipping on mobile.)\n  </p>\n\n  <p>\n    So I once again began the laborious process of opening links from Joplin to move to a self-hosted <a href=\"https://www.wallabag.it/en\" target=\"_blank\">Wallabag</a> instance. Notes stored in Joplin were converted to text based markdown files for use with Nextcloud Notes. Wallabag provides <i>most</i> of the function and convenience of Pocket without the payment and 3rd party involvement. This was satisfying for a year or two but ran into the similar feeling with Joplin. The workflow never felt very fluid and the actual effort of getting information when needed was tiring. The Android app worked well but the iOS apps I encountered were frustratingly designed resulting in one more laborious shift&nbsp;(I'm sure the last! 😜)  from Wallabag to CalDAV.\n  </p>\n\n    <h3 id=\"at-long-last-a-solution\">\n      At Long Last: A Solution!\n    </h3>\n\n  <p>\n    According to&nbsp;<a href=\"https://en.wikipedia.org/wiki/CalDAV\" target=\"_blank\">Wikipedia</a>,&nbsp;CalDAV&nbsp;is a WebDAV extension that \"allows multiple client access to the same information thus allowing cooperative planning and information sharing.\" There are many CalDAV providers and clients of all shapes and sizes providing the flexibility I have long desired. In my case I already had a Nextcloud instance setup at home for syncing calendars, contacts and files so an existing CalDAV server was ready to go. CalDAV is builtin to popular Linux desktop environments as well as Apple products; has a great app on Android (<a href=\"https://play.google.com/store/apps/details?id=at.bitfire.davdroid&amp;hl=en_US\" target=\"_blank\">DAVx⁵</a> for syncing with&nbsp;<a href=\"https://play.google.com/store/apps/details?id=org.dmfs.tasks\" target=\"_blank\">OpenTasks</a>&nbsp;as the client); and works well with a boatload of different applications such as <a href=\"https://www.thunderbird.net/\" target=\"_blank\">Thunderbird</a>, <a href=\"https://wiki.gnome.org/Apps/Evolution/\" target=\"_blank\">Evolution</a>, <a href=\"https://kontact.kde.org/\" target=\"_blank\">Kontact</a> and <a href=\"https://github.com/pimutils/khal\" target=\"_blank\">khal</a>.\n  </p>\n\n  <p>\n    This cleaned up my workflow and shrunk server maintenance as I consolidated all hosted tools down to Nextcloud which is simple to keep up to date. I changed the way I store information by using Apple's <a href=\"https://apps.apple.com/us/app/reminders/id1108187841\" target=\"_blank\">Reminders</a> app on my phone and Evolution or Thunderbird on my PC. Previously I saved the articles with Wallabag or Pocket. When I inevitably came back months later to do some mapping, a full reread was required to find the needed information. Now, I copy and paste the needed information into a task making it easy to pull up when the time comes. This also allows for reminder alerts and due dates. I have task lists for books, films, music, openstreetmap mapping, learning, work and home construction. Text tags are placed at the bottom of the task so I can search for the term later and have them appear.\n  </p>\n\n  <p>\n    Realizing earlier this year that all of my goals can be accomplished with my existing tools was an epiphany. After 5 years of hoping this or that service would add this or that feature I discovered everything is already in place. The solution to a problem that has been dragging on for years was in sight and only required a reevaluation of what is already in use.\n  </p>",
            "image": "https://MkeCountyBlog.com/media/posts/6/luis-villasmil-mlVbMbxfWI4-unsplash.jpg",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "iPhone",
                   "WebDAV",
                   "Wallabag",
                   "Pocket",
                   "Organization",
                   "Open Source",
                   "Nextcloud",
                   "Linux",
                   "Joplin",
                   "CalDAV",
                   "Apple",
                   "Android"
            ],
            "date_published": "2020-06-13T14:10:35-05:00",
            "date_modified": "2020-06-13T15:45:31-05:00"
        },
        {
            "id": "https://MkeCountyBlog.com/grid-milwaukees-bus-routes.html",
            "url": "https://MkeCountyBlog.com/grid-milwaukees-bus-routes.html",
            "title": "Grid Milwaukee&#x27;s Bus Routes",
            "summary": "This post is in no way a criticism of MCTS' current design. Inspired by an article from Strong Towns discussing Indianapolis' new route trials it provides an alternative system design. To explore a prospective grid patterned map for Milwaukee County click the button above overlaying the map.",
            "content_html": "<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"100%\" height=\"576\" src=\"https://maphub.net/embed/89503?legend=1\" frameborder=\"0\"></iframe></div>\n<p>This post is in no way a criticism of MCTS' current design. Inspired by <a href=\"https://www.strongtowns.org/journal/2020/1/24/how-to-get-to-great-bus-service-in-a-car-dominated-place\" title=\"How To Get To Great Bus Service In A Car-Dominated Place\" target=\"_blank\" rel=\"noopener noreferrer\">an article from Strong Towns</a> discussing Indianapolis' new route trials it provides an alternative system design. To explore a prospective grid patterned map for Milwaukee County click the button above overlaying the map. The orange lines are East-West routes (EW) and the green lines are North-South routes (NS). For the most part each route crosses the entire county from EW or NS. Riding the bus to any destination would require knowing the cross-streets. For example: to get from Northwestern Mutual's new building downtown to the Mitchell Park Domes you would get on a bus at Mason Street / Prospect Avenue (the Wisconsin Avenue turn around), ride west along Wisconsin Avenue and transfer to the 27th Street line heading South. The same route using the existing lines is shown below.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://MkeCountyBlog.com/media/posts/4/downtownToDomes.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://MkeCountyBlog.com/media/posts/4/responsive/downtownToDomes-xs.png 300w ,https://MkeCountyBlog.com/media/posts/4/responsive/downtownToDomes-sm.png 480w ,https://MkeCountyBlog.com/media/posts/4/responsive/downtownToDomes-md.png 768w ,https://MkeCountyBlog.com/media/posts/4/responsive/downtownToDomes-lg.png 1024w ,https://MkeCountyBlog.com/media/posts/4/responsive/downtownToDomes-xl.png 1360w ,https://MkeCountyBlog.com/media/posts/4/responsive/downtownToDomes-2xl.png 1600w\"  alt=\"MCTS' current route from Downtown to the Domes\" width=\"358\" height=\"700\">\n<figcaption >Your options for getting to the domes from downtown with the current routes. ©Ride MCTS</figcaption>\n</figure>\n<p>MCTS's existing routes are a bit more sporadic; utilizing a route number or color and destinations (ex: GoldLine Wisconsin Ave - UWM or 21 North Ave.) They have done a good job connecting major amenities but lack the ability to connect riders to every area in the county. Going from Bayside to Brown Deer takes 5-10 minutes by car and 1.5 hours by bus. Franklin and Oak Creek are nearly unreachable. The county's budget is tight every year due mostly to poor pension related decision making from the past so routes have been slowly disappearing or shrinking. MCTS, our county supervisors and our county executive do a good job maintaining the current routes to connect as many people as possible to key destinations (generally prioritizing job access) despite the lack of funds. Unfortunately the current setup appears to create a downward spiral of higher fares and lower ridership (much like the rest of the country.)</p>\n<figure class=\"post__image post__image--full\" ><img loading=\"lazy\" src=\"https://MkeCountyBlog.com/media/posts/4/mctsMap.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://MkeCountyBlog.com/media/posts/4/responsive/mctsMap-xs.png 300w ,https://MkeCountyBlog.com/media/posts/4/responsive/mctsMap-sm.png 480w ,https://MkeCountyBlog.com/media/posts/4/responsive/mctsMap-md.png 768w ,https://MkeCountyBlog.com/media/posts/4/responsive/mctsMap-lg.png 1024w ,https://MkeCountyBlog.com/media/posts/4/responsive/mctsMap-xl.png 1360w ,https://MkeCountyBlog.com/media/posts/4/responsive/mctsMap-2xl.png 1600w\"  alt=\"2020 Milwaukee County Transit Guide\" width=\"2323\" height=\"1941\">\n<figcaption ><a href=\"https://www.ridemcts.com/getattachment/Routes-Schedules/System-Map/2020-System-Map.pdf?lang=en-US\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"2020 Milwaukee County Transit Guide\">2020 Milwaukee County Transit Guide</a> - ©MCTS</figcaption>\n</figure>\n<p>Influenced by MCTS advertising and stories about bus drivers, I began riding during the summer of 2019. My wife and I moved from downtown to Bayside a few years ago after which she started a new job in the city. We enjoy eating at various restaurants all around the city (keep it in the county!) so in order to avoid driving two cars home after dinner I decided to start taking the bus down to meet her. MCTS is a great transportation option and I now take the bus to the city multiple times a week. The drivers are friendly, helpful, and know the different routes well enough to help a turned around newcomer (such a myself.) It also encourages me to get outside and walk more. It takes at least 30 minutes to walk to the nearest bus stop from my home. Another example is last fall when I got off at the east end of Brady street and walked west to Van Buren to meet my wife.</p>\n<p>The grid map represents what I believe our community should work towards. Every part of the county is fully accessible allowing people to leave their cars at home and get to every part of the county. The general idea at the start was to have each route separated by at most 3 blocks. This was mostly maintained but the south side is more spread out due to limitations of the existing street grid. The bus as a primary mode of transportation becomes practical for virtually everyone and finding your way to a destination is greatly simplified. Every single commercial, industrial and retail area (the jobs) is connected with the grid.</p>\n<p>In addition to changing the current routes I believe the county should utilize bus lanes as well as a system that forces traffic lights to change for buses as they approach an intersection; allowing them to maintain a constant speed along each route. This will help maintain a more predictable schedule for riders and speed up trips to further entice new ridership. A bus should pass each stop every 10 or 15 minutes. The stops are not mapped but assume every intersection of a NS and EW route is a stop with only a handful of additional stops needed.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Milwaukee_County_Transit_System#Bus_fleet\" title=\"Milwaukee County Transit System - Bus fleet\" target=\"_blank\" rel=\"noopener noreferrer\">According to Wikipedia</a>, Milwaukee currently has 369 active buses. I have mapped 27 EW routes and 49 NS routes. Assuming 3 buses per EW route 81 buses would be active at any given time. Milwaukee County's shape is tall and thin so the much longer NS routes double the number of buses per route compared with the EW routes. Assuming 6 buses per NS route you would have 294 buses active at any given time.  A few individual routes could utilize fewer buses and maintain the same frequency such as West Bradley Road which dies in River Hills where the Milwaukee River blocks its passage. </p>\n<p>A few key questions remam unanswered. How many of the currently active 369 buses are in use at any given time? A decent amount probably are rotated regularly in and out of service for maintenance. What is the breakdown of MCTS' $160 million budget? I assume most funding comes from federal grants, county/state funding, with a bit from rider fares (<a href=\"https://urbanmilwaukee.com/2020/02/27/urban-ideas-make-mcts-free-during-dnc/\" title=\"Make MCTS Free During DNC\" target=\"_blank\" rel=\"noopener noreferrer\">update</a>: fares annually contribute $30,771,208 or 19% of total funding - more than expected!) In my mind income from fares would very likely increase with the grid as more of the county would become accessible and the utility of the system would grow significantly. Why pay all of that money for Uber or Lyft when I can take the bus for $2 (or less!)? Why pay for two cars and maintenance when I can go everywhere with the bus? Has a public private partnership been explored for operating and expanding bus service in our area? </p>\n<p>While I personally believe this would be a fantastic system, I can already imagine the push back from those that don't want buses near their homes. It would largely follow the arguments used against apartments, building density or most (revenue generating) change of any kind introduced outside of downtown including crime, noise, environment, etc. It is impossible to improve upon the problems plaguing our area without trying something new.</p>\n<p>In the rare instances where our local politicians, against popular opinion, have moved forward with changes that they believe to be in the community's long term best interests these fears never seem to actualize. I still recall the fear from people when Best Buy was proposed for RiverPoint Village near where I grew up. The same arguments were vehemently presented but Best Buy was able to come anyways (probably since it was already zoned for retail.) The area remains largely the same now as it was then and nobody seems to think about or discuss it anymore.</p>\n<p>I believe the result of implementing a county-wide grid bus system would follow the same path; a loud opposition followed by everyone adapting to a significantly more useful transportation system that has little to no negative impact on their lives and neighborhoods. As with any idea, there's needs to be leadership that is willing to try things that may be unpopular.</p>\n<p>Edit 2020/04/27: Cleanup the intro a bit. Update post with information from the always useful <a href=\"https://urbanmilwaukee.com/\" title=\"Urban Milwaukee\" target=\"_blank\" rel=\"noopener noreferrer\">Urban Milwaukee</a>.</p>",
            "image": "https://MkeCountyBlog.com/media/posts/4/gridMilwaukeePostHeader.png",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "MapHub",
                   "MCTS",
                   "Grid",
                   "Bus Routes"
            ],
            "date_published": "2020-04-13T16:00:00-05:00",
            "date_modified": "2020-10-18T22:52:43-05:00"
        },
        {
            "id": "https://MkeCountyBlog.com/switching_to_the_brave_web_browser.html",
            "url": "https://MkeCountyBlog.com/switching_to_the_brave_web_browser.html",
            "title": "Switching to the Brave Web Browser",
            "summary": "A lesson I learned while teaching my Mom some computer tricks is that I should probably begin with what a (web) browser is. To do this, I'll start with a somewhat technical definition from Wikipedia, \"A web browser (commonly referred to as a browser) is a software application for accessing information&hellip;",
            "content_html": "<p>A lesson I learned while teaching my Mom some computer tricks is that I should probably begin with what a (web) browser is. To do this, I'll start with a somewhat technical definition from <a href=\"https://en.wikipedia.org/wiki/Web_browser\" title=\"Web browser\" target=\"_blank\" rel=\"noopener noreferrer\">Wikipedia</a>, \"A web browser (commonly referred to as a browser) is a software application for accessing information on the World Wide Web.\" Great, now lets simplify that a bit. You will likely recognize names such as Chrome, Firefox, Edge or Safari; these are different browsers. You open it up and use it to shop on Amazon or Etsy; Duck things on <a href=\"https://duckduckgo.com/\" target=\"_blank\" rel=\"noopener noreferrer\">duckduckgo</a>; checkout stuff on Pinterest, Reddit or Facebook, etc. You tell the browser what you want to see by typing in an URL, (for example <a href=\"https://google.com\">https://google.com</a>) or more likely just type in a search term and off you go!</p>\n<p>Hopefully you now recognize what a browser is but I imagine now you're wondering so what? Who cares what browser I use? For the most part it doesn't make much of a difference. They may use slightly different styling, or have some special feature you never use, but essentially they all take you to the same place. They connect you with websites and hopefully stay out of your way.</p>\n<p>I will pick on Chrome for this paragraph because it is mostly developed by the largest internet advertising company on the planet, Google. If I remember correctly, Chrome was created to speed up web browsing and improve browser security. Around 2010 Internet Explorer was full of security holes and Firefox was slow and bloated so the user experience was not particularly good. Also, Google wanted to be sure that the Google search engine remained the default option at least in Chrome since search ads drive a great deal of their revenue; IE or Firefox switching their default search provider at the time could have been very harmful to Google's bottom line.</p>\n<p>The green line on the chart below shows the change in Chrome's market share from 2009-2020. Today it controls roughly 65% of the browser market which gives Google a great deal of power in discussions about what standards are introduced and adopted and how they are implemented. Chrome is very slow to adopt the privacy features built-in to their competitor's browsers as they would negatively effect their advertising income. This allows them to better identify and track people in order to serve them more targeted advertisements and make more money.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://MkeCountyBlog.com/media/posts/3/StatCounter-browser-ww-monthly-200901-202002.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://MkeCountyBlog.com/media/posts/3/responsive/StatCounter-browser-ww-monthly-200901-202002-xs.png 300w ,https://MkeCountyBlog.com/media/posts/3/responsive/StatCounter-browser-ww-monthly-200901-202002-sm.png 480w ,https://MkeCountyBlog.com/media/posts/3/responsive/StatCounter-browser-ww-monthly-200901-202002-md.png 768w ,https://MkeCountyBlog.com/media/posts/3/responsive/StatCounter-browser-ww-monthly-200901-202002-lg.png 1024w ,https://MkeCountyBlog.com/media/posts/3/responsive/StatCounter-browser-ww-monthly-200901-202002-xl.png 1360w ,https://MkeCountyBlog.com/media/posts/3/responsive/StatCounter-browser-ww-monthly-200901-202002-2xl.png 1600w\"  alt=\"Web Browser Market Share Worldwide between January 2009 and February 2020\" width=\"1280\" height=\"720\"></figure>\n<p>Chrome is built on top of the open-source Chromium browser. Chrome is essentially Chromium with a Google sweatshirt. Everyone is free to use and change Chromium but that sweatshirt is hiding all of the extra stuff Google adds to build the proprietary Chrome. The source code is closed off so no one can see. You can think of Brave as Chromium with a completely different sweatshirt with all of its unique features open to everyone allowing us see, change and help improve it. So you get all of the security and speed benefits without most of the Google enabled tracking and privacy invading aspects of Chrome. </p>\n<p>That is the basic building blocks of the Brave browser. <strong>The truly revolutionary portion is their long-term goal of replacing the massive user tracking and profiling system that currently powers the internet economy with a privacy preserving advertising system built into the browser.</strong> Most internet services such as Gmail, Facebook, Instagram, Tiktok, newspapers, magazines, blogs, etc are funded through advertising. This is why a service like Hulu has a free tier with advertising while Netflix always requires you to pay. The trouble is, this business model incentivizes massive amounts of surveillance across the internet.</p>\n<blockquote>\n<p>\"Google controls about <a href=\"https://gs.statcounter.com/browser-market-share/mobile/worldwide\">62% of mobile browsers</a>, <a href=\"https://gs.statcounter.com/browser-market-share/desktop/worldwide\">69% of desktop browsers</a>, and the operating systems on <a href=\"https://www.netmarketshare.com/operating-system-market-share.aspx?options=%7B%22filter%22%3A%7B%22%24and%22%3A%5B%7B%22deviceType%22%3A%7B%22%24in%22%3A%5B%22Mobile%22%5D%7D%7D%5D%7D%2C%22dateLabel%22%3A%22Trend%22%2C%22attributes%22%3A%22share%22%2C%22group%22%3A%22platform%22%2C%22sort%22%3A%7B%22share%22%3A-1%7D%2C%22id%22%3A%22platformsMobile%22%2C%22dateInterval%22%3A%22Monthly%22%2C%22dateStart%22%3A%222019-02%22%2C%22dateEnd%22%3A%222020-01%22%2C%22segments%22%3A%22-1000%22%7D\">71% of mobile devices</a> in the world. <a href=\"https://gs.statcounter.com/search-engine-market-share\">92% of internet searches</a> go through Google and <a href=\"https://www.businessofapps.com/data/youtube-statistics/\">73% of American adults</a> use YouTube. Google runs code on approximately <a href=\"https://w3techs.com/technologies/details/ta-googleanalytics\">85% of sites on the Web</a> and inside <a href=\"https://www.statista.com/statistics/1035623/leading-mobile-app-ad-network-sdks-android/\">as many as 94%</a> of apps in the Play store. It collects data about users’ every click, tap, query, and movement from all of those sources and more.\" </p>\n<p><a href=\"https://www.eff.org/deeplinks/2020/03/google-says-it-doesnt-sell-your-data-heres-how-company-shares-monetizes-and\" title=\"Google Says It Doesn’t 'Sell' Your Data. Here’s How the Company Shares, Monetizes, and Exploits It.\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: -apple-system, BlinkMacSystemFont, Arial, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Fira Sans', 'Droid Sans', 'Helvetica Neue', sans-serif, 'Apple Color Emoji', 'Segoe UI Emoji', 'Segoe UI Symbol'; font-size: inherit;\">EFF - Google Says It Doesn't 'Sell' Your Data   </a></p>\n</blockquote>\n<p>Google and Facebook and dozens of other data companies encourage website owners to use their scripts on their websites so that they can track user activity everywhere they go on the internet and target them ads. By default, Brave blocks these trackers and identifying techniques to speed up browsing and protect users from this ridiculousness. Below is a list of tracking scripts blocked on a visit to the <a href=\"https://jsonline.com\" target=\"_blank\" rel=\"noopener noreferrer\">Milwaukee Journal Sentinel</a> website. Amazon, Facebook, Google and a sea of others are all utilized; drastically slowing down the web page's load time and adding a lot of annoying pop ups and videos to the website.</p>\n<p><span class=\"BlockedInfoRowStats-sc-u7266a iTuUMq\"><strong>What Brave Blocks on Milwaukee Journal Sentinel's website</strong></span></p>\n<p><span class=\"BlockedInfoRowStats-sc-u7266a iTuUMq\">31 </span><span class=\"BlockedListSummaryText-sc-1lnzx8i SlhMV\">Cross-site trackers blocked</span></p>\n<ul class=\"BlockedListStatic-sc-14k04lq dqWHj\">\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://www.gannett-cdn.com/uxstatic/jsonline/uscp-web-static-4525.20.0/js/partner/show_ads.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://try.abtasty.com/bcf3f16fe6dfff2da9b2400d218df47c.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://cdn.taboola.com/libtrc/gannett-network/loader.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://c2.taboola.com/nr/gannettcompany-jsonline/newsroom.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://cdn.taboola.com/libtrc/static/thumbnails/3aadbb71016ecd7a194bbe2791777e9a.png</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://confiant-integrations.global.ssl.fastly.net/r5TdgVvkbv-PeaJCKaQfCh5Xsto/gpt_and_prebid_v3l/config.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://pubads.g.doubleclick.net/gampad/adx?iu=%2F7103%2Fswg%2Fpts_wi-milwaukee-C1258&amp;sz=1x1&amp;ref=&amp;cookie=undefined&amp;c=141688919367667&amp;tile=1&amp;u_tz=-300</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://securepubads.g.doubleclick.net/tag/js/gpt.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://c.amazon-adsystem.com/aax2/apstag.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://cdn.adsafeprotected.com/iasPET.1.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://js-sec.indexww.com/ht/p/184808-89514051626416.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://www.gannett-cdn.com/partner/vendor/pbjsandwich-v1.min.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://connect.facebook.net/en_US/sdk.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://content-static.gannett.com/OpinionLab/oo_style.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://content-static.gannett.com/OpinionLab/oo_engine.min.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://static.adsafeprotected.com/iasADX.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://7q1z79gxsi.global.ssl.fastly.net/7q1z79gxsi-m.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://7q1z79gxsi.global.ssl.fastly.net/7q1z79gxsi-c.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://dpm.demdex.net/id?d_visid_ver=3.1.2&amp;d_fieldgroup=AAM&amp;d_rtbd=json&amp;d_ver=2&amp;d_orgid=CF4957F555EE9B727F000101%40AdobeOrg&amp;d_nsid=0&amp;d_mid=24905135920613042071094820707358437236&amp;ts=1584585491334</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://cdn.krxd.net/controltag/suw9jm9mz.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://cdn.parsely.com/keys/jsonline.com/p.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://sb.scorecardresearch.com/beacon.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://pixel.mathtag.com/event/js?mt_pp=1&amp;mt_adid=114093</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://www.googleadservices.com/pagead/conversion_async.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://b-code.liadm.com/a-048w.min.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://cdn.keywee.co/dist/analytics.min.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://resources.xg4ken.com/js/v2/ktag.js?tid=KT%E2%80%90N2B92%E2%80%903EB</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://connect.facebook.net/en_US/fbevents.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://10870841.collect.igodigital.com/collect.js</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://srepdata.jsonline.com/b/ss/globaldesktopmobilesite/1/JS-2.9.0/s0586757838856</li>\n<li class=\"BlockedListItem-sc-1xbwfrg eEkjIk\">https://www.google-analytics.com/analytics.js</li>\n</ul>\n<p>At this point you might be uneasy but still think, \"hey, they need to earn money to pay for their reporting. There aren't that many options for decent, local, investigative journalism and the newspaper industry has been hammered over the years (by Google &amp; Facebook as it turns out.)\" This is where Brave stands out from the other browsers. Instead of just blocking ads, Brave users are able to earn money in the form of Basic Attention Tokens (BAT) for allowing Brave to display ads occasionally. You are able to adjust how frequently they appear and are not required to enable them; it is an opt-in choice. At this point, the ads display as notifications on your computer or phone and disappear after a few seconds. When ads popup, you earn 70% of the ad revenue while the other 30% goes to Brave providing them with a dedicated funding source. Firefox, the third most used browser, is another open source browser with some ad-blocking but they rely on search engine providers for a large chunk of their annual funding leaving them with an unstable year to year budget and an uncertain future. They face the same problem as newspapers: since less people are using them, they get paid less for the default search engine rights and have less money to compete.</p>\n<p>Every month Brave distributes a user-adjustable percentage of your BAT to the websites you visit based on the amount of time you spent at each site. When the ad is displayed, you earn BAT; no need to click on the ad if you're not interested. The tracking and ad targeting is all done locally on your computer and is never sent anywhere or shared with anyone. This allows website owners and content creators to earn money without strong-arming users into giving information to Google and Facebook to sell to ad companies. When you browse Github, Reddit, Twitter or YouTube, the content creators are able to receive BAT instead of just the website operator. This means that Timmy will get BAT for his YouTube video when people watch it, not just YouTube.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://MkeCountyBlog.com/media/posts/3/braveNewTab.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://MkeCountyBlog.com/media/posts/3/responsive/braveNewTab-xs.png 300w ,https://MkeCountyBlog.com/media/posts/3/responsive/braveNewTab-sm.png 480w ,https://MkeCountyBlog.com/media/posts/3/responsive/braveNewTab-md.png 768w ,https://MkeCountyBlog.com/media/posts/3/responsive/braveNewTab-lg.png 1024w ,https://MkeCountyBlog.com/media/posts/3/responsive/braveNewTab-xl.png 1360w ,https://MkeCountyBlog.com/media/posts/3/responsive/braveNewTab-2xl.png 1600w\"  alt=\"Screenshot of Brave's new page\" width=\"1920\" height=\"1054\">\n<figcaption >Brave's new tab page where you can see what's been blocked and how much time you've saved. ©MCB</figcaption>\n</figure>\n<p>Brave seems like a near perfect compromise that benefits users, advertisers and content creators. Users continue to get free content as well as <a href=\"https://www.ghacks.net/2020/02/25/study-finds-brave-to-be-the-most-private-browser/\" title=\"Study finds Brave to be the most private browser\" target=\"_blank\" rel=\"noopener noreferrer\">the most private by default browser out there</a>; advertisers can continue to sell their wares; content creators can earn money for endeavors; all without the massive, privacy invading, information dragnet currently in place. I hope to see Brave usage increase and more websites sign on; especially in Milwaukee. Some companies certainly seem to be on board as lately larger companie's ads are showing up. User growth appears to be healthy as well; <a href=\"https://brave.com/brave-passes-10m-mau/\" title=\"Brave Passes 10 Million Monthly Active Users, and Sees 19% Growth since 1.0 Launch\" target=\"_blank\" rel=\"noopener noreferrer\">passing 10 million</a> last December.</p>\n<p>Of the different Milwaukee websites I frequent, <a href=\"https://urbanmilwaukee.com\" target=\"_blank\" rel=\"noopener noreferrer\">Urban Milwaukee</a> seems to have the most balanced approach with less tracking for paid members compared to free users. <a href=\"https://onmilwaukee.com/\" target=\"_blank\" rel=\"noopener noreferrer\">OnMilwaukee.com</a> unfortunately has no paid tier so tracking for everybody! <a href=\"https://milwaukeerecord.com/\">Milwaukee Record</a> uses broadstreetads.com which uses local advertising which is a plus. All three, regardless of tier, use the ubiquitous Google Analytics found on a large swath of the internet. Google Analytics monitors mouse movements, clicks, time spent on pages and much more; sending it all back to Google servers. The City of Milwaukee and Milwaukee County websites both have Google mixed in as well. Milwaukee County Blog use a locally hosted instance of <a href=\"https://matomo.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Matomo</a> so nobody gets any information but MCB and it is setup with some anonymizing settings enabled since I'm only interested in the number of visitors and if they come back (so far nobody but bots 😥.)</p>\n<p>Even if Brave doesn't sound like your cup of tea, I highly encourage people to install uBO-Scope (<a href=\"https://addons.mozilla.org/en-US/firefox/addon/ubo-scope/\" target=\"_blank\" rel=\"noopener noreferrer\">Firefox users</a> / <a href=\"https://chrome.google.com/webstore/detail/ubo-scope/bbdpgcaljkaaigfcomhidmneffjjjfgp\" target=\"_blank\" rel=\"noopener noreferrer\">Brave &amp; Chrome users</a>) so you can see all of the different companies tracking your every move online. If seeing all of the tracking doesn't make Brave or an ad blocker like uBlock Origin more appealing to you then so be it.</p>\n<figure class=\"post__image\"><a href=\"https://brave.com\" target=\"_blank\" rel=\"noopener noreferrer\"><img loading=\"lazy\"  src=\"https://MkeCountyBlog.com/media/posts/3/brave-bat-partnership.svg\" alt=\"Brave logo &amp; BAT logo\" width=\"1920\" height=\"387\"></figure></a></p>",
            "image": "https://MkeCountyBlog.com/media/posts/3/logotype_alt.svg",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "Web Browser",
                   "Privacy",
                   "Open Source",
                   "Firefox",
                   "Brave"
            ],
            "date_published": "2020-03-20T01:02:00-05:00",
            "date_modified": "2020-10-18T22:52:27-05:00"
        },
        {
            "id": "https://MkeCountyBlog.com/overlooked-privacy-issues-with-the-hops-new-kiosks.html",
            "url": "https://MkeCountyBlog.com/overlooked-privacy-issues-with-the-hops-new-kiosks.html",
            "title": "Overlooked Privacy Issues With The Hop&#x27;s New Kiosks",
            "summary": "A recent press release from The Hop offers details about the 8.5 foot “Smart Kiosks” being introduced to Milwaukee’s streetcar stops beginning in May. Cities around the world have been forming relationships with companies such as Smart City Media to create new sources of income for municipalities as well&hellip;",
            "content_html": "<p>A recent <a href=\"https://urbanmilwaukee.com/pressrelease/the-hop-unveils-citypost-smart-kiosk-initiative/\" title=\"The Hop Unveils CityPost Smart Kiosk Initiative\" target=\"_blank\" rel=\"noopener noreferrer\">press release</a> from The Hop offers details about the 8.5 foot “Smart Kiosks” being introduced to Milwaukee’s streetcar stops beginning in May. Cities around the world have been forming relationships with companies such as Smart City Media to create new sources of income for municipalities as well as bridge the gap between online advertising and people’s habits in the physical world.</p>\n<p>The idea normally revolves around using cameras, sensors and various other tracking techniques to connect people's online advertising profiles to their actions in the physical world while offering a somewhat useful tool in return at no cost to the municipality. Did Sam go to the store and buy that home mushroom farm we advertised on Instagram?</p>\n<p>These agreements often create concerns as a result of privacy and security considerations being an afterthought of companies and municipalities. When companies that specialize in advertising offer something for free, there is a trade off that often comes at the expense of an individual's privacy. When a budget strapped city such as Milwaukee is offered up to $500,000 annually at no expense, they tend not to focus on the details.</p>\n<p>Should a casual walk down the street require surveillance by the Milwaukee Police Department? Do these kiosks use beacons or WiFi-tracking techniques to track where people are going regardless of whether they connected to the WiFi and agreed to the terms? Answers to the questions below could help address these sorts of concerns.</p>\n<ol>\n<li>What and where is the privacy policy for these devices?</li>\n<li>What types of data are collected?</li>\n<li>How and why is it collected?</li>\n<li>How is the collected data anonymized?</li>\n<li>Is tracking limited to users that connect to the WiFi?</li>\n<li>Is the video and audio recording 24/7 or activated by the emergency feature?</li>\n<li>Who owns the video and audio data? Where and how is it stored? What is the retention policy? How will MPD use the video and audio feeds?</li>\n<li>What restrictions are in place on Smart City Media's usage and/or sale of collected data?</li>\n<li>What oversight is there to assure Smart City Media is following the terms of the contract in relation to data use, privacy and retention policies?</li>\n<li>How frequently are these devices' <a href=\"https://www.wired.com/story/visitor-management-system-vulnerabilities/\" title=\"The Overlooked Security Threat of Sign-In Kiosks\" target=\"_blank\" rel=\"noopener noreferrer\">software and OS updated</a>?</li>\n<li>Who owns the streetcar tracking and arrival time data?</li>\n</ol>\n<p>Smart City Media appears to be an honest company that provides useful products and provides a fair bargain with municipalities around the country. However, more information needs to be provided. The video surveillance aspect is particularly troubling as law enforcement should be limited to monitoring individuals suspected of crimes after getting a warrant; not broad, indiscriminate monitoring of large swaths of the city. As Bruce Schneier states in his book <em>Secrets and Lies, </em><strong>\"it is poor civic hygiene to install technologies that could someday facilitate a police state.\"</strong></p>\n<p><a href=\"https://www.chicagotribune.com/suburbs/aurora-beacon-news/ct-abn-aurora-kiosks-st-0925-story.html\"></a>Several other cities reversed course on the “smart kiosks” idea. In 2017, Seattle’s mayor <a href=\"https://www.geekwire.com/2018/seattles-plan-bring-intersection-wifi-kiosks-bus-stop-makeovers-stalled/\" title=\"Why Seattle’s plan to bring Intersection WiFi kiosks and bus stop makeovers stalled\" target=\"null\">rejected an initial proposal</a> from Intersection. Her communications director stated,</p>\n<blockquote>\n<p>“Mayor Durkan had significant concerns with both the privacy and data policies — specifically what data was collected, how it was stored, what tracking was possible, and how ads were targeted.”</p>\n</blockquote>\n<p>New York City had privacy issues exposed with their <a href=\"https://theintercept.com/2018/09/08/linknyc-free-wifi-kiosks/\" title=\"ARE NEW YORK’S FREE LINKNYC INTERNET KIOSKS TRACKING YOUR MOVEMENTS?\" target=\"_blank\" rel=\"noopener noreferrer\">smart payphone kiosks</a> installed throughout the city. “LinkNYC kiosks, at no cost to the city, would provide free internet coverage to anyone walking by.” The company working with NYC in this case also accidentally uploaded some testing source-code to Github,</p>\n<blockquote>“...the “LinkNYC Mobile Observation” code collects the user’s longitude and latitude, as well as the user’s browser type, operating system, device type, device identifiers, and full URL clickstreams (including date and time) and aggregates this information into a database. In Meyers’s view, this code — along with the functions of the “RxLocation” codebase — suggests that the company is interested in tracking the locations of Wi-Fi users in real time. If such code were run on a mobile app or kiosk, he said, the company would be able to make advertisements available in real time based on where and who someone was, and that this would constitute a potential violation of the company’s <a href=\"https://www.link.nyc/privacy-policy.html\" title=\"LinkNYC Privacy Policy\" target=\"_blank\" rel=\"noopener noreferrer\">privacy policy</a>. In 2016, LinkNYC’s privacy policy made it clear that it did not collect information about users’ precise locations. “However,” it states, “we know where we provide WiFi services, so when you use the services we can determine your general location.”</blockquote>\n<p> To reiterate, Smart City Media does not have a record of malfeasance that is readily discoverable through a quick duckduckgo search. That being said, it will benefit residents, visitors and our representatives to slow down, get clear answers to the above questions, verify that the proper safeguards are in place and that excessively intrusive technologies will not be introduced into our daily lives. Advertisements, like police, are necessary and beneficial to society but they should not be profiling our every click and movement (unless we have done something to truly justify it 😉.)</p>\n<p><em>03/16/2020 - This post was edited to add question #10 and to perform some small grammatical fixes.</em></p>",
            "image": "https://MkeCountyBlog.com/media/posts/2/Kiosk-Rendering.png",
            "author": {
                "name": "Colin White"
            },
            "tags": [
                   "The Hop",
                   "Surveillance",
                   "Privacy",
                   "MPD"
            ],
            "date_published": "2020-03-13T19:13:24-05:00",
            "date_modified": "2020-10-18T22:52:15-05:00"
        }
    ]
}
